In [84]:
import pandas as pd
import numpy as np
import os
import subprocess

from jupyter_client.session import Session

In [85]:
! python3 --version
! pip3 --version

Python 3.13.9
pip 25.3 from /opt/anaconda3/lib/python3.13/site-packages/pip (python 3.13)

In [86]:
cur_dir = os.getcwd()
path = os.path.abspath(os.getcwd())

In [87]:
! pip3 install --upgrade pip
! pip3 install openpyxl
! pip3 install sqlalchemy
! pip3 install psycopg2-binary
! pip3 install fastparquet
! pip3 install lxml

Requirement already satisfied: pip in /opt/anaconda3/lib/python3.13/site-packages (25.3)
Requirement already satisfied: openpyxl in /opt/anaconda3/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: et_xmlfile in /opt/anaconda3/lib/python3.13/site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.13/site-packages (2.0.39)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.13/site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.13/site-packages (2.9.11)
Requirement already satisfied: fastparquet in /opt/anaconda3/lib/python3.13/site-packages (2024.11.0)
Requirement already satisfied: pandas>=1.5.0 in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2.2.3)
Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2.1.3)
Requirement already satisfied: cramjam>=2.3 in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2.11.0)
Requirement already satisfied: fsspec in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2025.3.2)
Requirement already satisfied: packaging in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (24.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.13/site-packages (from pandas>=1.5.0->fastparquet) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas>=1.5.0->fastparquet) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas>=1.5.0->fastparquet) (2025.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas>=1.5.0->fastparquet) (1.17.0)
Requirement already satisfied: lxml in /opt/anaconda3/lib/python3.13/site-packages (5.3.0)

In [88]:
conn_str = "postgresql://avnadmin:AVNS_ZdDb93Yjx6l0LlnITsX@pg-230e9f42-jonas-syntra.b.aivencloud.com:23448/defaultdb?sslmode=require"

1. CSV-files
2. Excel-files
3. Parquet files
4. SQL Databases

## 1. CSV-files
Comma seperated files

### 1.1 Reading
#### 1.2 Basic cases
- data inlezen
- header kiezen
- index kiezen
- omgaan met missing data
- type casting
- selective reading

In [89]:
df = pd.read_csv(f'{path}/data/df1.csv')
df.head()

     name  age  score        date  value
0    Alex   20     50  01-12-2024    100
1   Robin   21     51  02-12-2024    101
2     Sam   22     52  03-12-2024    102
3   Jamie   23     53  04-12-2024    103
4  Taylor   24     54  05-12-2024    104

In [90]:
pd.read_csv(f'{path}/data/df1.csv', header=1)

      Alex  20  50  01-12-2024  100
0    Robin  21  51  02-12-2024  101
1      Sam  22  52  03-12-2024  102
2    Jamie  23  53  04-12-2024  103
3   Taylor  24  54  05-12-2024  104
4    Casey  25  55  06-12-2024  105
5   Jordan  26  56  07-12-2024  106
6      NaN  27  57  08-12-2024  107
7    Riley  28  58  09-12-2024  108
8  UNKNOWN  29  59  10-12-2024  109

In [91]:
pd.read_csv(f'{path}/data/df1.csv', usecols=list(range(0,1))+[2])

      name  score
0     Alex     50
1    Robin     51
2      Sam     52
3    Jamie     53
4   Taylor     54
5    Casey     55
6   Jordan     56
7      NaN     57
8    Riley     58
9  UNKNOWN     59

In [92]:
pd.read_csv(f'{path}/data/df1.csv', index_col=0)

         age  score        date  value
name
Alex      20     50  01-12-2024    100
Robin     21     51  02-12-2024    101
Sam       22     52  03-12-2024    102
Jamie     23     53  04-12-2024    103
Taylor    24     54  05-12-2024    104
Casey     25     55  06-12-2024    105
Jordan    26     56  07-12-2024    106
NaN       27     57  08-12-2024    107
Riley     28     58  09-12-2024    108
UNKNOWN   29     59  10-12-2024    109

In [93]:
pd.read_csv(f'{path}/data/df1.csv')

      name  age  score        date  value
0     Alex   20     50  01-12-2024    100
1    Robin   21     51  02-12-2024    101
2      Sam   22     52  03-12-2024    102
3    Jamie   23     53  04-12-2024    103
4   Taylor   24     54  05-12-2024    104
5    Casey   25     55  06-12-2024    105
6   Jordan   26     56  07-12-2024    106
7      NaN   27     57  08-12-2024    107
8    Riley   28     58  09-12-2024    108
9  UNKNOWN   29     59  10-12-2024    109

In [94]:
df = pd.read_csv(f'{path}/data/df1.csv', na_values=['UNKNOWN'])

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   age     10 non-null     int64
 2   score   10 non-null     int64
 3   date    10 non-null     object
 4   value   10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [96]:
test = pd.read_csv(f'{path}/data/df1.csv', dtype={'age':float})

In [97]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     10 non-null     float64
 2   score   10 non-null     int64
 3   date    10 non-null     object
 4   value   10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [98]:
df_without = pd.read_csv(f'{path}/data/df1.csv')
df_with = pd.read_csv(f'{path}/data/df1.csv', parse_dates=['date']
                      , date_format='%d-%m-%Y')

In [99]:
df_without.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     10 non-null     int64
 2   score   10 non-null     int64
 3   date    10 non-null     object
 4   value   10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [100]:
# df_without['date'].dt.month

In [101]:
df_with['date'].dt.day_name()

0       Sunday
1       Monday
2      Tuesday
3    Wednesday
4     Thursday
5       Friday
6     Saturday
7       Sunday
8       Monday
9      Tuesday
Name: date, dtype: object

In [102]:
pd.read_csv(f'{path}/data/df1.csv', skiprows=2)

     Robin  21  51  02-12-2024  101
0      Sam  22  52  03-12-2024  102
1    Jamie  23  53  04-12-2024  103
2   Taylor  24  54  05-12-2024  104
3    Casey  25  55  06-12-2024  105
4   Jordan  26  56  07-12-2024  106
5      NaN  27  57  08-12-2024  107
6    Riley  28  58  09-12-2024  108
7  UNKNOWN  29  59  10-12-2024  109

#### 1.1.2 Special cases
- different seperator
- Bad lines
- diffent encoding

In [103]:
pd.read_csv(f'{path}/data/df2.csv', delimiter=';')

      name  age  score
0     Alex   20     50
1    Robin   21     51
2      Sam   22     52
3    Jamie   23     53
4   Taylor   24     54
5    Casey   25     55
6   Jordan   26     56
7      NaN   27     57
8    Riley   28     58
9  UNKNOWN   29     59

In [104]:
pd.read_csv(f'{path}/data/df3.csv', on_bad_lines='warn')

/var/folders/0n/jy1lg2_n1755yht3lzxdrb0w0000gn/T/ipykernel_13770/1368792386.py:1: ParserWarning: Skipping line 7: expected 3 fields, saw 8

  pd.read_csv(f'{path}/data/df3.csv', on_bad_lines='warn')

      name  age  score
0     Alex   20     70
1    Robin   21     71
2      Sam   22     72
3    Jamie   23     73
4   Taylor   24     74
5    Casey   25     75
6   Jordan   26     76
7      NaN   27     77
8    Riley   28     78
9  UNKNOWN   29     79

In [105]:
pd.read_csv(f'{path}/data/df4.csv', encoding='latin1')

       naam      stad
0      José     Ghent
1     Anaïs    Bruges
2    Mårten   Antwerp
3       Zoë    Leuven
4     André   Hasselt
5    Émilie  Kortrijk
6     Renée     Liège
7     Søren     Namur
8     Björk    Ostend
9  François  Mechelen

In [106]:
pd.read_csv(f'{path}/data/df4.csv', encoding_errors='replace')

       naam      stad
0      Jos�     Ghent
1     Ana�s    Bruges
2    M�rten   Antwerp
3       Zo�    Leuven
4     Andr�   Hasselt
5    �milie  Kortrijk
6     Ren�e     Li�ge
7     S�ren     Namur
8     Bj�rk    Ostend
9  Fran�ois  Mechelen

### 1.2 Writing

In [107]:
df.to_csv(f'{path}/data/eerste.csv')

In [108]:
df.to_csv(f'{path}/data/tweede.csv', header=False)

In [109]:
df.to_csv(f'{path}/data/derde.csv', index=False)

In [110]:
df.to_csv(f'{path}/data/vierde.csv', sep=';')

## 2. Excel
### 2.1 Reading

In [111]:
pd.read_excel(f'{path}/data/example_excel_demo.xlsx')

   customer_id    city  amount        date
0            1   City1     101  2024-12-01
1            2   City2     102  2024-12-02
2            3   City3     103  2024-12-03
3            4   City4     104  2024-12-04
4            5   City5     105  2024-12-05
5            6   City6     106  2024-12-06
6            7   City7     107  2024-12-07
7            8   City8     108  2024-12-08
8            9   City9     109  2024-12-09
9           10  City10     110  2024-12-10

In [112]:
pd.read_excel(f'{path}/data/example_excel_demo.xlsx', sheet_name=['UselessCols', 'Sales'])

{'UselessCols':     A   B   C       D   E       F     G
 0   1   2   3  ignore NaN  REMOVE  1000
 1   2   4   6  ignore NaN  REMOVE  1001
 2   3   6   9  ignore NaN  REMOVE  1002
 3   4   8  12  ignore NaN  REMOVE  1003
 4   5  10  15  ignore NaN  REMOVE  1004
 5   6  12  18  ignore NaN  REMOVE  1005
 6   7  14  21  ignore NaN  REMOVE  1006
 7   8  16  24  ignore NaN  REMOVE  1007
 8   9  18  27  ignore NaN  REMOVE  1008
 9  10  20  30  ignore NaN  REMOVE  1009,
 'Sales':    customer_id    city  amount        date
 0            1   City1     101  2024-12-01
 1            2   City2     102  2024-12-02
 2            3   City3     103  2024-12-03
 3            4   City4     104  2024-12-04
 4            5   City5     105  2024-12-05
 5            6   City6     106  2024-12-06
 6            7   City7     107  2024-12-07
 7            8   City8     108  2024-12-08
 8            9   City9     109  2024-12-09
 9           10  City10     110  2024-12-10}

In [113]:
pd.read_excel(f'{path}/data/example_excel_demo.xlsx', sheet_name=[0, 2])

{0:    customer_id    city  amount        date
 0            1   City1     101  2024-12-01
 1            2   City2     102  2024-12-02
 2            3   City3     103  2024-12-03
 3            4   City4     104  2024-12-04
 4            5   City5     105  2024-12-05
 5            6   City6     106  2024-12-06
 6            7   City7     107  2024-12-07
 7            8   City8     108  2024-12-08
 8            9   City9     109  2024-12-09
 9           10  City10     110  2024-12-10,
 2:    # Report generated 2025 Unnamed: 1 Unnamed: 2
 0           # Confidential        NaN        NaN
 1                     col1       col2       col3
 2                        1         11        101
 3                        2         12        102
 4                        3         13        103
 5                        4         14        104
 6                        5         15        105
 7                        6         16        106
 8                        7         17        107
 9                        8         18        108
 10                       9         19        109
 11                      10         20        110}

In [114]:
pd.read_excel(f'{path}/data/example_excel_demo.xlsx', sheet_name='UselessCols', usecols=['A','B','C'])

    A   B   C
0   1   2   3
1   2   4   6
2   3   6   9
3   4   8  12
4   5  10  15
5   6  12  18
6   7  14  21
7   8  16  24
8   9  18  27
9  10  20  30

In [115]:
pd.read_excel(f'{path}/data/example_excel_demo.xlsx', sheet_name='UselessCols', usecols=['A','B','C'])

    A   B   C
0   1   2   3
1   2   4   6
2   3   6   9
3   4   8  12
4   5  10  15
5   6  12  18
6   7  14  21
7   8  16  24
8   9  18  27
9  10  20  30

In [116]:
pd.read_excel(f'{path}/data/example_excel_demo.xlsx', sheet_name='UselessCols', usecols='A:C')

    A   B   C
0   1   2   3
1   2   4   6
2   3   6   9
3   4   8  12
4   5  10  15
5   6  12  18
6   7  14  21
7   8  16  24
8   9  18  27
9  10  20  30

In [117]:
pd.read_excel(f'{path}/data/example_excel_demo.xlsx', sheet_name='Formulas')

    A   B  SUM
0   1   2  NaN
1   2   4  NaN
2   3   6  NaN
3   4   8  NaN
4   5  10  NaN
5   6  12  NaN
6   7  14  NaN
7   8  16  NaN
8   9  18  NaN
9  10  20  NaN

### 2.2 Writing

In [118]:
df.to_excel(f'{path}/data/eerste.xlsx')

In [119]:
df.to_excel(f'{path}/data/tweede.xlsx', sheet_name='Sales Data')
df.to_excel(f'{path}/data/tweede.xlsx', sheet_name='Sales Data2')

## 3. SQL
### 3.1 Reading

In [120]:
from sqlalchemy import create_engine

engine = create_engine(conn_str)

In [121]:
query = 'select * from customers'
pd.read_sql(query,engine)

    id     name      city   spend
0    1      Sam    Bruges   89.99
1    2    Robin   Antwerp  145.20
2    3   Taylor    Leuven  220.00
3    4     Alex     Ghent  120.50
4    5    Jamie   Hasselt  310.75
5    6    Casey  Brussels  510.00
6    7   Jordan  Mechelen   15.99
7    8    Avery    Leuven  260.10
8    9    Quinn     Ghent   75.40
9   10   Morgan    Bruges  420.00
10  11    Riley   Antwerp   55.00
11  12     Drew  Kortrijk  133.33
12  13   Parker  Brussels  980.90
13  14   Skyler     Namur  450.50
14  15  Cameron     Ghent  199.99
15  16   Dakota    Ostend  305.50
16  17    Reese   Antwerp   80.00
17  18    Blake   Hasselt  720.00
18  19  Charlie    Leuven   38.25
19  20  Emerson    Bruges  155.75

### 3.2 Writing

In [122]:
df.to_sql(name='New Table',
          con = engine,
          if_exists= 'replace',
          index=False,
          )

10

## 4. Other formats

In [126]:
pd.read_parquet(f'{path}/data/output.parquet').head()

   id  name   city  spend
0   4  Alex  Ghent  120.5

In [127]:
df.to_parquet(f'{path}/data/output2.parquet')

In [130]:
pd.read_pickle(f'{path}/data/df.pkl')

   id  name   city  spend
0   4  Alex  Ghent  120.5

In [131]:
df.to_pickle(f'{path}/data/df2.pkl')

In [135]:
pd.read_html("http://www.fdic.gov/bank/individual/failed/banklist.html")[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

In [138]:
pd.read_html("http://www.fdic.gov/bank/individual/failed/banklist.html")[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

In [139]:
pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv')

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick,NaN,NaN,NaN,NaN,NaN
194,22.5,6,232,90,3085,17.6,76,1,amc hornet,NaN,NaN,NaN,NaN,NaN
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette,NaN,NaN,NaN,NaN,NaN
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody,NaN,NaN,NaN,NaN,NaN
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit,NaN,NaN,NaN,NaN,NaN